### 索引对象

In [2]:
from pandas import Series,DataFrame

In [3]:
import pandas as pd

In [4]:
import numpy as np

#### 通过索引从Series中取值

In [31]:
series02=Series([34.56,23.34,45.66,98.08],index=['2001','2002','2003','2004'])

In [32]:
series02

2001    34.56
2002    23.34
2003    45.66
2004    98.08
dtype: float64

In [33]:
series02['2002']

23.34

包头包尾，边界右边是包含的，这与Python基础中的列表等不一样

In [8]:
series02['2002':'2004']

2002    23.34
2003    45.66
2004    98.08
dtype: float64

In [9]:
series02['2002':]

2002    23.34
2003    45.66
2004    98.08
dtype: float64

In [10]:
series02[:'2003']

2001    34.56
2002    23.34
2003    45.66
dtype: float64

In [11]:
series02['2001']=11.11

In [12]:
series02[:'2002']

2001    11.11
2002    23.34
dtype: float64

In [13]:
series02['2003':]=[33.33,44.44]

In [14]:
series02

2001    11.11
2002    23.34
2003    33.33
2004    44.44
dtype: float64

#### 通过索引从DataFrame中取值
    可以通过列索引获取指定列的数据
    要通过行索引获取指定行数据需要ix方法

In [12]:
data={'apart':['1001','1002','1003','1001'],
     'profits':[567.87,987.87,873,498.87],
     'year':[2001,2001,2001,2000]}

In [13]:
df=DataFrame(data)

In [14]:
df

  apart  profits  year
0  1001   567.87  2001
1  1002   987.87  2001
2  1003   873.00  2001
3  1001   498.87  2000

In [15]:
df['year']

0    2001
1    2001
2    2001
3    2000
Name: year, dtype: int64

In [16]:
df.ix[0:2]

D:\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

  apart  profits  year
0  1001   567.87  2001
1  1002   987.87  2001
2  1003   873.00  2001

In [17]:
df['pdn']=np.NaN

In [18]:
df

  apart  profits  year  pdn
0  1001   567.87  2001  NaN
1  1002   987.87  2001  NaN
2  1003   873.00  2001  NaN
3  1001   498.87  2000  NaN

### 常用的数学和统计方法
    对于DataFrame，这些统计方法，默认是计算各列上的数据
    如果要应用于各行数据，则增加参数axis=1

In [19]:
df.count()

apart      4
profits    4
year       4
pdn        0
dtype: int64

In [20]:
df.count(axis=1)

0    3
1    3
2    3
3    3
dtype: int64

In [21]:
df.describe()

          profits     year  pdn
count    4.000000     4.00  0.0
mean   731.902500  2000.75  NaN
std    235.682465     0.50  NaN
min    498.870000  2000.00  NaN
25%    550.620000  2000.75  NaN
50%    720.435000  2001.00  NaN
75%    901.717500  2001.00  NaN
max    987.870000  2001.00  NaN

In [22]:
df.max()

apart      1003.00
profits     987.87
year       2001.00
pdn            NaN
dtype: float64

In [23]:
df.min()

apart      1001.00
profits     498.87
year       2000.00
pdn            NaN
dtype: float64

In [34]:
series02.argmin()

'2002'

In [35]:
df.argmax()

AttributeError: 'DataFrame' object has no attribute 'argmax'

In [36]:
df.idxmin()

apart      0.0
profits    3.0
year       3.0
pdn        NaN
dtype: float64

In [37]:
series02.idxmin()

'2002'

In [38]:
df.quantile()

profits     720.435
year       2001.000
pdn             NaN
Name: 0.5, dtype: float64

In [39]:
df.sum()

apart      1.001100e+15
profits    2.927610e+03
year       8.003000e+03
pdn                 NaN
dtype: float64

In [40]:
series02.sum()

201.64

In [41]:
df.sum()['year']

8003.0

### 协方差cov  相关系数corr
    www.zhihu.com/question/20852004

In [42]:
df=DataFrame({'GDP':[12,23,34,45,56],'air_temperature':[23,25,26,27,30]},index=['2001','2002','2003','2004','2005'])

In [43]:
df

      GDP  air_temperature
2001   12               23
2002   23               25
2003   34               26
2004   45               27
2005   56               30

In [44]:
df.cov()

                   GDP  air_temperature
GDP              302.5             44.0
air_temperature   44.0              6.7

In [45]:
df.corr()

                      GDP  air_temperature
GDP              1.000000         0.977356
air_temperature  0.977356         1.000000

In [46]:
df['GDP'].corr(df['air_temperature'])

0.97735555485044179

In [47]:
series=Series([13,13.3,13.5,13.6,13.7],index=['2001','2002','2003','2004','2005'])

In [48]:
series

2001    13.0
2002    13.3
2003    13.5
2004    13.6
2005    13.7
dtype: float64

In [49]:
df.corrwith(series)

GDP                0.968665
air_temperature    0.932808
dtype: float64

In [50]:
df['GDP'].corr(series)

0.96866489990692228

### 唯一值 值计数 成员资格
    unique 用于获取Series唯一值数组   去重
    value_counts方法，用于计算一个Series中各值出现的频率    统计频率
    isin用于判断矢量化集合的成员资格，可用于选取Series或DataFrame中列中数据的子集

In [51]:
ser=Series(['a','b','c','d','a','a','c'])

In [52]:
ser.unique()

array(['a', 'b', 'c', 'd'], dtype=object)

In [53]:
ser.value_counts()

a    3
c    2
d    1
b    1
dtype: int64

In [54]:
ser.value_counts(ascending=False)

a    3
c    2
d    1
b    1
dtype: int64

In [55]:
ser.isin(['b','c'])

0    False
1     True
2     True
3    False
4    False
5    False
6     True
dtype: bool

In [56]:
ser[ser.isin(['b','c'])]

1    b
2    c
6    c
dtype: object

In [57]:
df=DataFrame({'orderId':[1001,1002,1003,1004],'orderAmt':[345.67,34.23,456.77,334.55],
              'memberId':['a1001','b1002','a1001','a1001']})

In [58]:
df

  memberId  orderAmt  orderId
0    a1001    345.67     1001
1    b1002     34.23     1002
2    a1001    456.77     1003
3    a1001    334.55     1004

In [59]:
df['memberId'].unique()

array(['a1001', 'b1002'], dtype=object)

In [60]:
mask=df.isin([1001,1002])

In [61]:
mask

   memberId  orderAmt  orderId
0     False     False     True
1     False     False     True
2     False     False    False
3     False     False    False

### 处理缺失数据
    dropna
    fillna
    isnull
    notnull

In [62]:
data=DataFrame([[1.,3.4,4.],[np.nan,np.nan,np.nan],[np.nan,4.5,6.7]])

In [63]:
data

     0    1    2
0  1.0  3.4  4.0
1  NaN  NaN  NaN
2  NaN  4.5  6.7

In [64]:
data.isnull()

       0      1      2
0  False  False  False
1   True   True   True
2   True  False  False

In [65]:
data.notnull()

       0      1      2
0   True   True   True
1  False  False  False
2  False   True   True

In [66]:
data[data.notnull()]

     0    1    2
0  1.0  3.4  4.0
1  NaN  NaN  NaN
2  NaN  4.5  6.7

 默认丢弃含有nan的全部行

In [67]:
data.dropna()

     0    1    2
0  1.0  3.4  4.0

丢弃值全为nan的行

In [68]:
data.dropna(how='all')

     0    1    2
0  1.0  3.4  4.0
2  NaN  4.5  6.7

In [69]:
data[4]=([1,2,3])

In [70]:
data

     0    1    2  4
0  1.0  3.4  4.0  1
1  NaN  NaN  NaN  2
2  NaN  4.5  6.7  3

In [71]:
data[4]=np.NaN

In [72]:
data

     0    1    2   4
0  1.0  3.4  4.0 NaN
1  NaN  NaN  NaN NaN
2  NaN  4.5  6.7 NaN

丢弃值全部为nan的列

In [73]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  3.4  4.0
1  NaN  NaN  NaN
2  NaN  4.5  6.7

In [74]:
data

     0    1    2   4
0  1.0  3.4  4.0 NaN
1  NaN  NaN  NaN NaN
2  NaN  4.5  6.7 NaN

In [75]:
data.sum(axis=1)

0     8.4
1     0.0
2    11.2
dtype: float64

填充缺失数据

In [76]:
df=DataFrame(np.random.random((7,3)))

In [77]:
df

          0         1         2
0  0.249695  0.207854  0.324549
1  0.507203  0.569095  0.148743
2  0.874858  0.111929  0.692000
3  0.922723  0.039986  0.056946
4  0.183679  0.538770  0.628536
5  0.240288  0.304121  0.944170
6  0.605399  0.746915  0.715151

#### np.random.randn(7,3) ?

In [78]:
DataFrame(np.random.randn(7,3))

          0         1         2
0  0.141278  0.748438 -0.288400
1  0.694178 -0.094963  0.989583
2 -1.021880 -2.322506 -1.035821
3 -0.390697 -0.822170 -1.129366
4 -0.412995  0.012372 -0.037137
5  0.789369  0.729285 -1.348627
6  0.097743 -0.197670  0.212375

In [79]:
df.ix[:4,1]=np.NaN

D:\Anaconda2\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [80]:
df

          0         1         2
0  0.249695       NaN  0.324549
1  0.507203       NaN  0.148743
2  0.874858       NaN  0.692000
3  0.922723       NaN  0.056946
4  0.183679       NaN  0.628536
5  0.240288  0.304121  0.944170
6  0.605399  0.746915  0.715151

In [81]:
df.ix[:2,2]=np.NaN

In [82]:
df

          0         1         2
0  0.249695       NaN       NaN
1  0.507203       NaN       NaN
2  0.874858       NaN       NaN
3  0.922723       NaN  0.056946
4  0.183679       NaN  0.628536
5  0.240288  0.304121  0.944170
6  0.605399  0.746915  0.715151

In [83]:
df[1]

0         NaN
1         NaN
2         NaN
3         NaN
4         NaN
5    0.304121
6    0.746915
Name: 1, dtype: float64

In [84]:
df.fillna(0)

          0         1         2
0  0.249695  0.000000  0.000000
1  0.507203  0.000000  0.000000
2  0.874858  0.000000  0.000000
3  0.922723  0.000000  0.056946
4  0.183679  0.000000  0.628536
5  0.240288  0.304121  0.944170
6  0.605399  0.746915  0.715151

### 层次化索引

In [85]:
data=Series([988.44,95859,3949.44,32445.44,234.45],index=[[2001,2002,2003,2004,2005],['苹果','西瓜','香蕉','苹果','西瓜']])

In [86]:
data

2001  苹果      988.44
2002  西瓜    95859.00
2003  香蕉     3949.44
2004  苹果    32445.44
2005  西瓜      234.45
dtype: float64

In [87]:
data.index.names=['年份','水果类别']

In [88]:
data

年份    水果类别
2001  苹果        988.44
2002  西瓜      95859.00
2003  香蕉       3949.44
2004  苹果      32445.44
2005  西瓜        234.45
dtype: float64

In [89]:
df=DataFrame({'year':[2001,2001,2002,2002,2003],'fruit':['apple','banana','apple','banana','apple'],
              'production':[2345,3423,4556,4455,534],'profits':[2344.44,23523.3,2345.32,25251.34,2454.35]})

In [90]:
df

    fruit  production   profits  year
0   apple        2345   2344.44  2001
1  banana        3423  23523.30  2001
2   apple        4556   2345.32  2002
3  banana        4455  25251.34  2002
4   apple         534   2454.35  2003

In [91]:
df.set_index(['year','fruit'])

             production   profits
year fruit
2001 apple         2345   2344.44
     banana        3423  23523.30
2002 apple         4556   2345.32
     banana        4455  25251.34
2003 apple          534   2454.35

In [92]:
new_df=df.set_index(['year','fruit'])

In [93]:
new_df.index

MultiIndex(levels=[[2001, 2002, 2003], [u'apple', u'banana']],
           labels=[[0, 0, 1, 1, 2], [0, 1, 0, 1, 0]],
           names=[u'year', u'fruit'])

In [94]:
new_df.sum(level="year")

      production   profits
year
2001        5768  25867.74
2002        9011  27596.66
2003         534   2454.35

In [95]:
new_df.sum(level='fruit')

        production   profits
fruit
apple         7435   7144.11
banana        7878  48774.64

In [96]:
new_df.count(level='fruit')

        production  profits
fruit
apple            3        3
banana           2        2